{
  "fisica": [
    {
      "id": 1,
      "tema": "Cinemática (MRU)",
      "dba": "DBA 1 (G10): Comprende que el reposo o el movimiento rectilíneo uniforme se presentan cuando las fuerzas aplicadas sobre el sistema se anulan entre sí.",
      "nivel": "Interpretativo",
      "dificultad": "Media",
      "clave": "B",
      "justificacion": "En una gráfica de Posición vs. Tiempo, una línea recta inclinada indica velocidad constante. Si la pendiente es cero (línea horizontal), el objeto está en reposo.",
      "rec_estudiante": "Repasar la interpretación de gráficas de posición vs. tiempo. Diferenciar entre pendiente (velocidad) y altura (posición).",
      "rec_docente": "Implementar laboratorios con sensores de movimiento o simuladores (PhET) para correlacionar el movimiento real con la generación de la gráfica en tiempo real."
    },
    {
      "id": 2,
      "tema": "Cinemática (MRUA)",
      "dba": "DBA 1 (G10): Predice el movimiento de un cuerpo a partir de las expresiones matemáticas.",
      "nivel": "Argumentativo",
      "dificultad": "Alta",
      "clave": "C",
      "justificacion": "La aceleración es el cambio de velocidad en el tiempo (a = Δv/t). Se requiere identificar que si la velocidad aumenta linealmente, la aceleración es constante y positiva.",
      "rec_estudiante": "Practicar el cálculo de pendientes en gráficas de velocidad vs. tiempo y relacionarlas con la aceleración media.",
      "rec_docente": "Reforzar el concepto de aceleración como 'tasa de cambio de velocidad' y no solo como 'ir rápido'. Usar ejemplos de frenado (aceleración negativa)."
    },
    {
      "id": 3,
      "tema": "Caída Libre",
      "dba": "DBA 1 (G10): Comprende que la aceleración debida a la gravedad es constante cerca de la superficie terrestre.",
      "nivel": "Propositivo",
      "dificultad": "Baja",
      "clave": "A",
      "justificacion": "En ausencia de resistencia del aire (vacío ideal o cuerpos densos a baja altura), todos los cuerpos caen con la misma aceleración (g), independientemente de su masa.",
      "rec_estudiante": "Recordar que en caída libre ideal, la masa no afecta el tiempo de caída; solo importa la altura.",
      "rec_docente": "Realizar demostraciones de 'caída en vacío' (o videos del tubo de Newton) para romper la intuición errónea de que los objetos pesados caen más rápido."
    },
    {
      "id": 4,
      "tema": "Mov. Parabólico",
      "dba": "DBA 1 (G10): Describe el movimiento de cuerpos en dos dimensiones.",
      "nivel": "Interpretativo",
      "dificultad": "Alta",
      "clave": "D",
      "justificacion": "En el punto más alto de una trayectoria parabólica, la velocidad vertical (Vy) es cero, pero la velocidad horizontal (Vx) es constante y distinta de cero. La aceleración es siempre g (hacia abajo).",
      "rec_estudiante": "Estudiar la descomposición vectorial del movimiento. Recordar que la gravedad siempre actúa, incluso en el punto más alto.",
      "rec_docente": "Utilizar diagramas de vectores paso a paso en el tablero mostrando cómo cambia Vy mientras Vx y g permanecen constantes."
    },
    {
      "id": 5,
      "tema": "Mov. Semiparabólico",
      "dba": "DBA 1 (G10): Relaciona las variables de posición, velocidad y aceleración.",
      "nivel": "Argumentativo",
      "dificultad": "Media",
      "clave": "B",
      "justificacion": "El tiempo de vuelo en un lanzamiento horizontal depende exclusivamente de la altura desde la que cae (y), no de la velocidad horizontal inicial (Vx).",
      "rec_estudiante": "Reforzar las ecuaciones de caída libre. Comprender el principio de independencia de movimientos (Galileo).",
      "rec_docente": "Realizar la práctica de lanzar dos objetos simultáneamente (uno dejado caer y otro lanzado horizontalmente) para ver que tocan el suelo al tiempo."
    },
    {
      "id": 6,
      "tema": "Dinámica (1ª Ley)",
      "dba": "DBA 2 (G10): Comprende que el reposo o el movimiento rectilíneo uniforme se presentan cuando las fuerzas se anulan.",
      "nivel": "Interpretativo",
      "dificultad": "Baja",
      "clave": "A",
      "justificacion": "La inercia es la propiedad de los cuerpos de mantener su estado de movimiento. Al frenar el bus, los pasajeros siguen moviéndose a la velocidad que traían.",
      "rec_estudiante": "Diferenciar entre fuerza e inercia. La inercia no es una fuerza que te empuja, es tu propia masa resistiéndose al cambio.",
      "rec_docente": "Usar situaciones cotidianas (frenadas bruscas en Transmilenio/Bus, cinturones de seguridad) para vivenciar la Ley de Inercia."
    },
    {
      "id": 7,
      "tema": "Dinámica (2ª Ley)",
      "dba": "DBA 2 (G10): Predice el equilibrio o la aceleración de un cuerpo (F=ma).",
      "nivel": "Argumentativo",
      "dificultad": "Media",
      "clave": "C",
      "justificacion": "Según F=ma, si aplicamos la misma fuerza a una masa mayor, la aceleración será menor (inversamente proporcionales).",
      "rec_estudiante": "Analizar la ecuación F=ma proporcionalmente. ¿Qué pasa con a si m se duplica y F es constante?",
      "rec_docente": "Trabajar con carritos dinámicos variando la masa (agregando pesas) y manteniendo la fuerza (mismo elástico) para observar el cambio en velocidad."
    },
    {
      "id": 8,
      "tema": "Estática",
      "dba": "DBA 2 (G10): Identifica las fuerzas que actúan sobre un cuerpo (DCL).",
      "nivel": "Interpretativo",
      "dificultad": "Alta",
      "clave": "B",
      "justificacion": "En un sistema en equilibrio (lámpara colgada), la tensión del cable debe igualar el peso del objeto para que la suma de fuerzas sea cero.",
      "rec_estudiante": "Practicar Diagramas de Cuerpo Libre (DCL). Entender que 'reposo' significa suma de fuerzas igual a cero.",
      "rec_docente": "Enfatizar la importancia de dibujar todas las fuerzas antes de plantear ecuaciones. Usar dinamómetros colgados para visualizar la tensión."
    },
    {
      "id": 9,
      "tema": "DCL (Vel. Constante)",
      "dba": "DBA 2 (G10): Establece condiciones para que un cuerpo se mueva con velocidad constante.",
      "nivel": "Propositivo",
      "dificultad": "Media",
      "clave": "D",
      "justificacion": "Si un objeto se mueve a velocidad constante (sin aceleración), la fuerza neta debe ser cero. La fuerza aplicada debe ser igual y opuesta a la fuerza de fricción.",
      "rec_estudiante": "Comprender que 'Velocidad Constante' es dinámicamente equivalente a 'Reposo' en cuanto a fuerzas (Sum F = 0).",
      "rec_docente": "Debatir la diferencia entre 'moverse' (velocidad) y 'empezar a moverse' (aceleración). El caso del paracaidista en velocidad terminal es un buen ejemplo."
    },
    {
      "id": 10,
      "tema": "Dinámica (3ª Ley)",
      "dba": "DBA 2 (G10): Analiza situaciones en las que se presentan fuerzas de acción y reacción.",
      "nivel": "Argumentativo",
      "dificultad": "Baja",
      "clave": "C",
      "justificacion": "La 3ª Ley de Newton establece que las fuerzas siempre ocurren en pares de igual magnitud y dirección opuesta, actuando sobre cuerpos diferentes.",
      "rec_estudiante": "Recordar: La fuerza es una interacción, no una propiedad. Si A golpea a B, B golpea a A con la misma intensidad.",
      "rec_docente": "Usar patines o patinetas: si un estudiante empuja a otro, ambos se mueven hacia atrás. Mostrar que la fuerza es mutua."
    }
  ],

"matematicas": [
    {
      "id": 1,
      "tema": "Trigonometría (Triángulo Rectángulo)",
      "dba": "DBA 4 (G10): Resuelve problemas mediante el uso de razones trigonométricas.",
      "nivel": "Propositivo",
      "dificultad": "Media",
      "clave": "C",
      "justificacion": "Se forma un triángulo rectángulo. El cateto opuesto (altura parcial) se halla con 20 * tan(θ). La altura total (H) requiere sumar la altura del teodolito (1,5 m). Expresión: H = 20*tan(θ) + 1,5.",
      "rec_estudiante": "Recordar siempre sumar la altura del observador o del instrumento cuando se miden ángulos de elevación desde el suelo.",
      "rec_docente": "Realizar prácticas de campo en el patio del colegio midiendo los árboles o canchas con un teodolito casero."
    },
    {
      "id": 2,
      "tema": "Función Lineal",
      "dba": "DBA 3 (G11): Modela situaciones de variación con funciones lineales.",
      "nivel": "Interpretativo",
      "dificultad": "Baja",
      "clave": "A",
      "justificacion": "Es una función de la forma y = mx + b. El costo fijo ($50.000) es el intercepto (b) y el costo por km ($2.000) es la pendiente (m). La gráfica debe empezar en 50.000 en el eje Y y subir.",
      "rec_estudiante": "Aprender a identificar el valor fijo (intercepto Y) y el valor que varía (pendiente) en problemas de costos.",
      "rec_docente": "Analizar recibos de servicios públicos locales que tengan cargo fijo y cargo por consumo."
    },
    {
      "id": 3,
      "tema": "Funciones Trigonométricas (Periodo)",
      "dba": "DBA 4 (G10): Reconoce características de las gráficas de funciones trigonométricas.",
      "nivel": "Interpretativo",
      "dificultad": "Alta",
      "clave": "B",
      "justificacion": "El periodo determina cada cuánto se repite el ciclo de la función (ej. calidad del aire diaria). Si el periodo pedido es π, la función seno o coseno debe estar multiplicada por 2 en su argumento (ej. sin(2x)).",
      "rec_estudiante": "Estudiar la fórmula del periodo T = 2π/B para las funciones y = A*sin(Bx).",
      "rec_docente": "Usar simuladores o Geogebra para mostrar cómo al cambiar el valor de 'B' la onda se comprime o se estira."
    },
    {
      "id": 4,
      "tema": "Ley de Senos",
      "dba": "DBA 4 (G10): Aplica la ley de senos en la resolución de triángulos no rectángulos.",
      "nivel": "Argumentativo",
      "dificultad": "Alta",
      "clave": "D",
      "justificacion": "Conociendo un lado (10 km) y los ángulos adyacentes, se halla el tercer ángulo. Luego, usando la Ley de Senos: b/sin(B) = 10/sin(C), se despeja la distancia b.",
      "rec_estudiante": "Recordar que la suma interna de los ángulos de un triángulo es 180° para hallar el ángulo faltante antes de aplicar la Ley de Senos.",
      "rec_docente": "Plantear problemas de triangulación geográfica reales en mapas de la región."
    },
    {
      "id": 5,
      "tema": "Geometría Analítica (Circunferencia)",
      "dba": "DBA 5 (G10): Explora e infiere las características de las secciones cónicas.",
      "nivel": "Propositivo",
      "dificultad": "Media",
      "clave": "C",
      "justificacion": "La ecuación canónica es (x-h)² + (y-k)² = r². Con centro en (3,4) y radio 5, la ecuación queda: (x-3)² + (y-4)² = 25.",
      "rec_estudiante": "Tener cuidado con los signos al reemplazar las coordenadas del centro (h,k) en la fórmula.",
      "rec_docente": "Relacionar el radio al cuadrado (r²) de la ecuación de la circunferencia con el Teorema de Pitágoras."
    },
    {
      "id": 6,
      "tema": "Estadística (Media y Mediana)",
      "dba": "DBA 2 (G11): Compara características de dos o más conjuntos de datos.",
      "nivel": "Interpretativo",
      "dificultad": "Baja",
      "clave": "A",
      "justificacion": "Suma: 10+0+5+20+15 = 50. Media = 50/5 = 10. Para la mediana, al ordenar (0, 5, 10, 15, 20), el valor central es 10.",
      "rec_estudiante": "¡No olvidar! Para calcular la mediana, SIEMPRE se deben ordenar los datos primero de menor a mayor.",
      "rec_docente": "Mostrar cómo un valor atípico (ej. 100 mm de lluvia) afecta drásticamente la media pero no la mediana."
    },
    {
      "id": 7,
      "tema": "Función Exponencial",
      "dba": "DBA 3 (G11): Modela situaciones de crecimiento exponencial.",
      "nivel": "Argumentativo",
      "dificultad": "Media",
      "clave": "A",
      "justificacion": "La ecuación A = 2^t indica que la base es 2, lo que significa que el valor se multiplica por 2 (se duplica) por cada unidad de tiempo t.",
      "rec_estudiante": "Diferenciar entre un crecimiento sumativo (lineal) y uno multiplicativo (exponencial).",
      "rec_docente": "El juego de doblar una hoja de papel múltiples veces o historias de granos de arroz en un tablero de ajedrez."
    },
    {
      "id": 8,
      "tema": "Función Cuadrática (Parábola)",
      "dba": "DBA 3 (G11): Identifica las características de las gráficas de funciones.",
      "nivel": "Interpretativo",
      "dificultad": "Baja",
      "clave": "B",
      "justificacion": "En el contexto de la gráfica de una trayectoria parabólica, el vértice representa el punto máximo (altura máxima en Y) y la coordenada X correspondiente es la distancia horizontal.",
      "rec_estudiante": "Aprender a leer coordenadas cartesianas (x,y) e interpretar qué variable física representa cada eje.",
      "rec_docente": "Conectar este análisis con los conceptos físicos del Movimiento Parabólico."
    },
    {
      "id": 9,
      "tema": "Optimización (Área de Rectángulo)",
      "dba": "DBA 3 (G11): Usa funciones polinómicas para resolver problemas de áreas.",
      "nivel": "Propositivo",
      "dificultad": "Alta",
      "clave": "D",
      "justificacion": "Perímetro = 40, entonces 2x + 2y = 40, lo que da y = 20 - x. El área A = base * altura = x * (20 - x) = 20x - x².",
      "rec_estudiante": "Practicar la sustitución de una variable usando el perímetro para dejar la ecuación de área en función de una sola incógnita.",
      "rec_docente": "Usar un trozo de cuerda de longitud fija para mostrar que se pueden formar rectángulos con diferentes áreas."
    },
    {
      "id": 10,
      "tema": "Probabilidad Simple",
      "dba": "DBA 2 (G11): Resuelve problemas que requieren calcular probabilidades.",
      "nivel": "Argumentativo",
      "dificultad": "Media",
      "clave": "C",
      "justificacion": "Total de botones = 10. Botones que NO son verdes = 5 rojos + 3 azules = 8. Probabilidad = 8/10 = 0.8 (80%).",
      "rec_estudiante": "Leer cuidadosamente las preguntas con negaciones (ej. 'NO sea verde'). Es útil usar el evento complemento (1 - Probabilidad de verde).",
      "rec_docente": "Llevar bolsas con bolas de colores para realizar la extracción real empírica."
    },
    {
      "id": 11,
      "tema": "Estadística (Histogramas)",
      "dba": "DBA 2 (G11): Lee e interpreta gráficos estadísticos de datos agrupados.",
      "nivel": "Interpretativo",
      "dificultad": "Media",
      "clave": "B",
      "justificacion": "El problema especifica 15 plantas en la barra de 140-160 cm. El porcentaje se calcula: (15 / 50) * 100% = 30%.",
      "rec_estudiante": "Recordar cómo se calcula un porcentaje: (Parte / Total) multiplicado por 100.",
      "rec_docente": "Enseñar a tabular los datos obtenidos de un histograma antes de realizar los cálculos porcentuales."
    },
    {
      "id": 12,
      "tema": "Estadística (Gráficos Circulares)",
      "dba": "DBA 2 (G11): Relaciona la información de gráficos porcentuales con datos reales.",
      "nivel": "Propositivo",
      "dificultad": "Media",
      "clave": "A",
      "justificacion": "Si el área de Aguacate representa el 30% en el gráfico, el cálculo es: 10 hectáreas * 0.30 = 3 hectáreas.",
      "rec_estudiante": "Tener claro que un gráfico circular siempre debe sumar 100% y que las proporciones se multiplican por el valor total real.",
      "rec_docente": "Pedir a los estudiantes que construyan gráficos circulares a mano usando transportador (regla de 3 con 360°)."
    },
    {
      "id": 13,
      "tema": "Estadística (Gráficos de Barras)",
      "dba": "DBA 2 (G11): Realiza comparaciones entre múltiples variables usando gráficos.",
      "nivel": "Argumentativo",
      "dificultad": "Baja",
      "clave": "C",
      "justificacion": "Se debe contrastar la altura de las dos barras (Producto A y B) trimestre a trimestre para validar cuál afirmación descriptiva es verdadera respecto al cruce de ventas.",
      "rec_estudiante": "Leer detenidamente la leyenda (convenciones) del gráfico para no confundir cuál barra representa a qué producto.",
      "rec_docente": "Analizar en clase por qué la elección del tipo de gráfico (barras vs líneas) influye en la facilidad para comparar datos."
    }
  ],

  "quimica": [
    {
      "id": 1,
      "tema": "Reacciones Químicas (Balanceo y Neutralización)",
      "dba": "DBA 2 (G10): Comprende que la materia se conserva en las reacciones químicas.",
      "nivel": "Interpretativo",
      "dificultad": "Baja",
      "clave": "A",
      "justificacion": "Balanceo correcto de masa en síntesis de hidróxido: CaO + H2O -> Ca(OH)2. La ecuación cumple la Ley de Lavoisier manteniendo la misma cantidad de átomos en reactivos y productos.",
      "rec_estudiante": "Aprender a contar los átomos de cada elemento en los reactivos y compararlos con los productos para verificar el balanceo.",
      "rec_docente": "Usar el contexto del agro local para explicar cómo las bases (hidróxidos) neutralizan los suelos ácidos."
    },
    {
      "id": 2,
      "tema": "Enlaces Químicos",
      "dba": "DBA 1 (G10): Explica las propiedades de las sustancias en función del tipo de enlace.",
      "nivel": "Interpretativo",
      "dificultad": "Media",
      "clave": "C",
      "justificacion": "La unión entre iones (catión amonio y anión nitrato) es iónica por la atracción de cargas opuestas, aunque dentro de ellos haya enlaces covalentes.",
      "rec_estudiante": "Diferenciar entre los enlaces covalentes que mantienen unidos a los átomos dentro de los iones poliatómicos, y el enlace iónico que une a los dos iones entre sí.",
      "rec_docente": "Explicar cómo las sales fertilizantes se disocian en iones al disolverse en el agua del suelo, permitiendo su absorción por las plantas."
    },
    {
      "id": 3,
      "tema": "Leyes de los Gases (Gay-Lussac)",
      "dba": "DBA 3 (G10): Comprende el comportamiento de los gases ideales.",
      "nivel": "Argumentativo",
      "dificultad": "Media",
      "clave": "B",
      "justificacion": "Ley de Gay-Lussac: P2 = P1 * (T2/T1). Hay un aumento proporcional con la temperatura absoluta. (2 atm * 400 K / 300 K = 2.66 atm).",
      "rec_estudiante": "Recordar que para aplicar las leyes de los gases, la temperatura siempre debe estar expresada en grados Kelvin, no en Celsius.",
      "rec_docente": "Hacer analogías con ollas de presión en la cocina para ilustrar cómo el aumento de temperatura eleva la presión si el volumen no cambia."
    },
    {
      "id": 4,
      "tema": "Soluciones Químicas (% p/v)",
      "dba": "DBA 3 (G10): Realiza cálculos cuantitativos que relacionan soluto y solvente.",
      "nivel": "Propositivo",
      "dificultad": "Media",
      "clave": "B",
      "justificacion": "Definición % p/v = (masa del soluto / volumen de solución) * 100. En este caso: (50g / 500mL) * 100 = 10%.",
      "rec_estudiante": "Identificar claramente en el enunciado cuál dato corresponde al soluto (sulfato de cobre) y cuál a la solución total.",
      "rec_docente": "Realizar diluciones reales en el laboratorio escolar midiendo volúmenes y masas."
    },
    {
      "id": 5,
      "tema": "Estequiometría (Cálculo Masa-Masa)",
      "dba": "DBA 2 (G10): Realiza cálculos cuantitativos en reacciones químicas.",
      "nivel": "Argumentativo",
      "dificultad": "Alta",
      "clave": "B",
      "justificacion": "Estequiometría molar: 1 mol de glucosa produce 2 moles de etanol según la ecuación balanceada. Como el etanol pesa 46 g/mol, el cálculo es 2 x 46g = 92g.",
      "rec_estudiante": "Aprender a calcular masas molares sumando los pesos atómicos y usar los coeficientes estequiométricos de la ecuación balanceada.",
      "rec_docente": "Vincular la estequiometría con la producción industrial o artesanal de fermentados locales."
    },
    {
      "id": 6,
      "tema": "Ácidos, Bases y pH",
      "dba": "DBA 2 (G10): Explica el comportamiento de ácidos y bases y su efecto en el entorno.",
      "nivel": "Propositivo",
      "dificultad": "Alta",
      "clave": "C",
      "justificacion": "Para obtener color rosa (ambiente alcalino), se debe subir el pH del suelo usando una base fuerte o moderada, como la cal agrícola.",
      "rec_estudiante": "Entender la escala de pH: valores menores a 7 son ácidos y mayores a 7 son básicos o alcalinos.",
      "rec_docente": "Usar jugo de repollo morado como indicador de pH casero y probarlo con sustancias como vinagre, limón, bicarbonato y jabón."
    },
    {
      "id": 7,
      "tema": "Cinética Química",
      "dba": "DBA 2 (G10): Analiza los factores que afectan la velocidad de las reacciones químicas.",
      "nivel": "Interpretativo",
      "dificultad": "Media",
      "clave": "B",
      "justificacion": "Cinética: Una menor temperatura (como en la nevera) reduce la energía cinética molecular, ralentizando la reacción de descomposición de la lactosa.",
      "rec_estudiante": "Interpretar la pendiente de las curvas en gráficas de concentración vs. tiempo; una caída más suave significa una reacción más lenta.",
      "rec_docente": "Debatir por qué utilizamos refrigeradores para conservar los alimentos, conectándolo directamente con la cinética molecular."
    },
    {
      "id": 8,
      "tema": "Estructura Orgánica (Alcoholes)",
      "dba": "DBA 4 (G11): Identifica los grupos funcionales de las moléculas orgánicas.",
      "nivel": "Interpretativo",
      "dificultad": "Baja",
      "clave": "A",
      "justificacion": "Nomenclatura Orgánica: El grupo funcional -OH (hidroxilo) unido a un carbono saturado define a la familia de los alcoholes, como el metanol.",
      "rec_estudiante": "Reconocer visualmente el grupo funcional hidroxilo (-OH) como el rasgo característico que define a los alcoholes simples.",
      "rec_docente": "Construir modelos tridimensionales con plastilina y palillos para visualizar cómo el reemplazo de un átomo cambia la familia de la molécula orgánica."
    }
  ],
  "biologia": [
    {
      "id": 1,
      "tema": "Ecología (DBO)",
      "dba": "DBA 5 (G10): Dinámica de ecosistemas.",
      "nivel": "Interpretativo",
      "dificultad": "Alta",
      "clave": "C",
      "justificacion": "DBO alto indica contaminación orgánica; las bacterias consumen el oxígeno disuelto para degradar la materia.",
      "rec_estudiante": "Relacionar calidad de agua con biodiversidad e indicadores químicos.",
      "rec_docente": "Visita a planta de tratamiento o análisis de agua local."
    },
    {
      "id": 2,
      "tema": "Redes Tróficas",
      "dba": "DBA 5 (G10): Flujo de energía.",
      "nivel": "Interpretativo",
      "dificultad": "Baja",
      "clave": "B",
      "justificacion": "Las flechas indican la dirección del flujo de energía. Solo el 10% de la energía pasa al siguiente nivel.",
      "rec_estudiante": "Dibujar redes tróficas locales (quién se come a quién).",
      "rec_docente": "Juego de roles: 'La telaraña de la vida' con hilo."
    },
    {
      "id": 3,
      "tema": "Genética (Mendel)",
      "dba": "DBA 3 (G11): Herencia y variabilidad.",
      "nivel": "Argumentativo",
      "dificultad": "Media",
      "clave": "A",
      "justificacion": "Cuadros de Punnett predicen probabilidades genotípicas y fenotípicas. La dominancia incompleta genera fenotipos intermedios.",
      "rec_estudiante": "Practicar cruces genéticos y probabilidades (1:2:1).",
      "rec_docente": "Usar rasgos físicos de la clase (lóbulo oreja, lengua) para ver frecuencias."
    },
    {
      "id": 4,
      "tema": "Osmosis (Celular)",
      "dba": "DBA 4 (G11): Transporte membrana celular.",
      "nivel": "Argumentativo",
      "dificultad": "Alta",
      "clave": "D",
      "justificacion": "El agua se mueve de una zona de menor concentración de soluto a una de mayor concentración (hipotónico a hipertónico).",
      "rec_estudiante": "Entender hipertónico, hipotónico e isotónico.",
      "rec_docente": "Huevo en vinagre y luego en agua/miel (experimento clásico)."
    },
    {
      "id": 5,
      "tema": "Adaptación (Altitud)",
      "dba": "DBA 1 (G11): Homeostasis y adaptación.",
      "nivel": "Propositivo",
      "dificultad": "Media",
      "clave": "B",
      "justificacion": "A mayor altitud hay menor presión de oxígeno, lo que estimula la producción de glóbulos rojos (aumento de hematocrito).",
      "rec_estudiante": "Estudiar fisiología respiratoria y circulatoria básica.",
      "rec_docente": "Analizar datos de deportistas entrenando en altura."
    },
    {
      "id": 6,
      "tema": "Selección Natural",
      "dba": "DBA 1 (G11): Evolución de poblaciones.",
      "nivel": "Argumentativo",
      "dificultad": "Media",
      "clave": "C",
      "justificacion": "Sobreviven los individuos con características ventajosas para su entorno, transmitiéndolas a su descendencia.",
      "rec_estudiante": "Diferenciar entre adaptación individual y evolución poblacional.",
      "rec_docente": "Simulación de 'picos de pinzones' con herramientas y semillas."
    },
    {
      "id": 7,
      "tema": "Ingeniería Genética",
      "dba": "DBA 3 (G11): Aplicaciones biotecnológicas.",
      "nivel": "Propositivo",
      "dificultad": "Alta",
      "clave": "A",
      "justificacion": "La modificación del ADN permite insertar genes de otras especies para conferir resistencia o producción de compuestos.",
      "rec_estudiante": "Debate ético sobre transgénicos (OGM).",
      "rec_docente": "Investigar casos reales (arroz dorado, insulina humana)."
    },
    {
      "id": 8,
      "tema": "Fotosíntesis",
      "dba": "DBA 4 (G11): Metabolismo celular.",
      "nivel": "Interpretativo",
      "dificultad": "Media",
      "clave": "B",
      "justificacion": "Los cloroplastos captan energía lumínica. Los estomas regulan el intercambio gaseoso (CO2 y O2) y la transpiración.",
      "rec_estudiante": "Ecuación general de la fotosíntesis (entradas y salidas).",
      "rec_docente": "Observar estomas al microscopio (epidermis de hoja)."
    }
  ]
}